Repository: Sanjarbek17/send_sms_test_app
Catalog: lib/l10n/app_*.arb
Languages: ru, uz

# appTitle
source: SMS Sender Pro
ru: SMS Отправитель Про
uz: SMS Yuboruvchi Pro

# welcome
source: Welcome to SMS Sender Pro!
ru: Добро пожаловать в SMS Отправитель Про!
uz: SMS Yuboruvchi Pro'ga xush kelibsiz!

# welcomeDescription
source: Your professional SMS broadcasting solution. Send messages to multiple contacts with ease.
ru: Ваше профессиональное решение для рассылки SMS. Легко отправляйте сообщения множественным контактам.
uz: Sizning professional SMS eshittirish yechimingiz. Ko'plab kontaktlarga oson SMS yuboring.

source: SMS Service Ready
ru: SMS Сервис Готов
uz: SMS Xizmati Tayyor

source: SMS Service Unavailable
ru: SMS Сервис Недоступен
uz: SMS Xizmati Mavjud Emas

# deviceReady
source: Your device is ready to send SMS messages
ru: Ваше устройство готово к отправке SMS сообщений
uz: Qurilmangiz SMS yuborish uchun tayyor

# checkSimCard
source: Please check your SIM card and permissions
ru: Пожалуйста, проверьте вашу SIM карту и разрешения
uz: Iltimos, SIM kartangiz va ruxsatlarni tekshiring

source: Retry Check
ru: Повторить Проверку
uz: Qayta Tekshirish

source: Quick Actions
ru: Быстрые Действия
uz: Tez Amallar

source: Test SMS
ru: Тест SMS
uz: SMS Sinovi

source: Send test message
ru: Отправить тестовое сообщение
uz: Sinov xabarini yuborish

source: Bulk SMS
ru: Массовая SMS
uz: Ommaviy SMS

source: Send to multiple contacts
ru: Отправить множественным контактам
uz: Ko'plab kontaktlarga yuborish

source: Settings
ru: Настройки
uz: Sozlamalar

source: Configure app settings
ru: Настроить параметры приложения
uz: Ilova sozlamalarini sozlash

source: Help
ru: Помощь
uz: Yordam

source: Troubleshooting guide
ru: Руководство по устранению неполадок
uz: Muammolarni hal qilish qo'llanmasi

source: Key Features
ru: Ключевые Функции
uz: Asosiy Xususiyatlar

source: Bulk Messaging
ru: Массовая Рассылка
uz: Ommaviy Xabar Yuborish

# bulkMessagingDesc
source: Send SMS to multiple contacts from CSV/Excel files
ru: Отправляйте SMS множественным контактам из CSV/Excel файлов
uz: CSV/Excel fayllaridan ko'plab kontaktlarga SMS yuboring

source: Secure & Private
ru: Безопасно и Приватно
uz: Xavfsiz va Shaxsiy

# securePrivateDesc
source: All messages are sent directly from your device
ru: Все сообщения отправляются напрямую с вашего устройства
uz: Barcha xabarlar to'g'ridan-to'g'ri qurilmangizdan yuboriladi

source: Dual SIM Support
ru: Поддержка Двух SIM
uz: Ikki SIM Qo'llab-quvvatlash

# dualSimSupportDesc
source: Choose which SIM card to use for sending
ru: Выберите какую SIM карту использовать для отправки
uz: Yuborish uchun qaysi SIM kartani tanlashni tanlang

source: Progress Tracking
ru: Отслеживание Прогресса
uz: Jarayon Kuzatuvi

# progressTrackingDesc
source: Real-time progress monitoring during bulk sends
ru: Мониторинг прогресса в реальном времени во время массовой отправки
uz: Ommaviy yuborishlar paytida real vaqtda jarayon monitoring

source: Home
ru: Главная
uz: Bosh sahifa

source: Test SMS Functionality
ru: Тест SMS Функциональности
uz: SMS Funksiyasini Sinash

# testSMSDescription
source: Send a test message to verify your SMS setup before bulk sending. This helps ensure your device, SIM card, and permissions are working correctly.
ru: Отправьте тестовое сообщение для проверки настроек SMS перед массовой отправкой. Это помогает убедиться, что ваше устройство, SIM карта и разрешения работают правильно.
uz: Ommaviy yuborishdan oldin SMS sozlamalaringizni tekshirish uchun sinov xabarini yuboring. Bu qurilma, SIM karta va ruxsatlaringiz to'g'ri ishlashini ta'minlashga yordam beradi.

# tipTestWithOwnNumber
source: Tip: Test with your own number first
ru: Совет: Сначала протестируйте с вашим собственным номером
uz: Maslahat: Avval o'z raqamingiz bilan sinab ko'ring

source: Phone Number
ru: Номер Телефона
uz: Telefon Raqami

source: Test Phone Number
ru: Тестовый Номер Телефона
uz: Sinov Telefon Raqami

# enterPhoneNumber
source: Enter the phone number you want to test with (including country code)
ru: Введите номер телефона для тестирования (включая код страны)
uz: Sinov qilmoqchi bo'lgan telefon raqamini kiriting (mamlakat kodini ham qo'shib)

source: Test Message
ru: Тестовое Сообщение
uz: Sinov Xabari

source: Enter test message
ru: Введите тестовое сообщение
uz: Sinov xabarini kiriting

# testMessageHint
source: Hello! This is a test message from SMS Sender Pro.
ru: Привет! Это тестовое сообщение от SMS Отправитель Про.
uz: Salom! Bu SMS Yuboruvchi Pro'dan sinov xabari.

# writeTestMessage
source: Write a short test message to verify SMS functionality
ru: Напишите короткое тестовое сообщение для проверки SMS функциональности
uz: SMS funksiyasini tekshirish uchun qisqa sinov xabarini yozing

source: Clear All
ru: Очистить Все
uz: Hammasini Tozalash

# sendTestMessageBtn
source: Send Test Message
ru: Отправить Тестовое Сообщение
uz: Sinov Xabarini Yuborish

source: Sending Test...
ru: Отправка Теста...
uz: Sinov Yuborilmoqda...

# pleaseEnterPhoneNumber
source: Please enter a phone number
ru: Пожалуйста, введите номер телефона
uz: Iltimos, telefon raqamini kiriting

# pleaseEnterMessage
source: Please enter a message
ru: Пожалуйста, введите сообщение
uz: Iltimos, xabarni kiriting

# pleaseEnterTestMessage
source: Please enter a test message
ru: Пожалуйста, введите тестовое сообщение
uz: Iltimos, sinov xabarini kiriting

# readyToSendTest
source: Ready to send test message
ru: Готов к отправке тестового сообщения
uz: Sinov xabarini yuborishga tayyor

source: Select Contact File
ru: Выбрать Файл Контактов
uz: Kontakt Faylini Tanlash

source: contacts loaded
ru: контактов загружено
uz: kontakt yuklandi

# readyToSendBulk
source: Ready to send bulk messages
ru: Готов к массовой отправке сообщений
uz: Ommaviy xabarlar yuborishga tayyor

source: Message Content
ru: Содержание Сообщения
uz: Xabar Mazmuni

source: Enter your message
ru: Введите ваше сообщение
uz: Xabaringizni kiriting

# messageHint
source: Type the message you want to send to all contacts...
ru: Введите сообщение, которое вы хотите отправить всем контактам...
uz: Barcha kontaktlarga yubormoqchi bo'lgan xabaringizni yozing...

# helperText
source: This message will be sent to all selected contacts
ru: Это сообщение будет отправлено всем выбранным контактам
uz: Bu xabar barcha tanlangan kontaktlarga yuboriladi

source: Clear All Data
ru: Очистить Все Данные
uz: Barcha Ma'lumotlarni Tozalash

source: Send to All Contacts
ru: Отправить Всем Контактам
uz: Barcha Kontaktlarga Yuborish

source: Sending...
ru: Отправка...
uz: Yuborilmoqda...

# pleaseSelectFile
source: Please select a contact file first
ru: Пожалуйста, сначала выберите файл контактов
uz: Iltimos, avval kontakt faylini tanlang

# pleaseEnterMessageToSend
source: Please enter a message to send
ru: Пожалуйста, введите сообщение для отправки
uz: Iltimos, yuborish uchun xabarni kiriting

# readyToSendToContacts
source: Ready to send to {count} contacts
ru: Готов к отправке {count} контактам
uz: {count} ta kontaktga yuborishga tayyor

source: Sending Progress
ru: Прогресс Отправки
uz: Yuborish Jarayoni

# messagesSent
source: {sent} of {total} messages sent
ru: Отправлено {sent} из {total} сообщений
uz: {total} tadan {sent} ta xabar yuborildi

source: SMS Service Status
ru: Статус SMS Сервиса
uz: SMS Xizmati Holati

source: SMS Ready
ru: SMS Готов
uz: SMS Tayyor

source: SMS Not Available
ru: SMS Недоступен
uz: SMS Mavjud Emas

# deviceReadyForSMS
source: Your device is ready to send SMS messages
ru: Ваше устройство готово к отправке SMS сообщений
uz: Qurilmangiz SMS yuborish uchun tayyor

# checkSimCardPermissions
source: Please check SIM card, permissions, and device SMS support
ru: Пожалуйста, проверьте SIM карту, разрешения и поддержку SMS устройством
uz: Iltimos, SIM karta, ruxsatlar va qurilma SMS qo'llab-quvvatlashini tekshiring

source: Permissions
ru: Разрешения
uz: Ruxsatlar

source: SIM Card Selection
ru: Выбор SIM Карты
uz: SIM Karta Tanlash

source: App Information
ru: Информация о Приложении
uz: Ilova Ma'lumotlari

source: Version
ru: Версия
uz: Versiya

source: Developer
ru: Разработчик
uz: Ishlab chiquvchi

source: Platform
ru: Платформа
uz: Platforma

# smsTeam
source: SMS Sender Pro Team
ru: Команда SMS Отправитель Про
uz: SMS Yuboruvchi Pro Jamoasi

source: Android & iOS
ru: Android и iOS
uz: Android va iOS

source: Request Permissions
ru: Запросить Разрешения
uz: Ruxsat So'rash

# whyPermissions
source: Why these permissions?
ru: Зачем эти разрешения?
uz: Nega bu ruxsatlar?

source: Granted
ru: Предоставлено
uz: Berilgan

source: Denied
ru: Отклонено
uz: Rad etilgan

source: Permanently Denied
ru: Навсегда Отклонено
uz: Doimiy Rad Etilgan

source: Restricted
ru: Ограничено
uz: Cheklangan

source: Unknown
ru: Неизвестно
uz: Noma'lum

source: SMS Troubleshooting
ru: Устранение Неполадок SMS
uz: SMS Muammolarini Hal Qilish

# troubleshootingIntro
source: If you're having trouble sending SMS:
ru: Если у вас проблемы с отправкой SMS:
uz: Agar SMS yuborishda muammo bo'lsa:

# simCardIssue
source: SIM Card
ru: SIM Карта
uz: SIM Karta

# simCardDesc
source: Make sure your device has an active SIM card inserted and it's properly recognized.
ru: Убедитесь, что в вашем устройстве установлена активная SIM карта и она правильно распознается.
uz: Qurilmangizda faol SIM karta kiritilganligini va u to'g'ri tanilganligini tekshiring.

# permissionsIssue
source: Permissions
ru: Разрешения
uz: Ruxsatlar

# permissionsDesc
source: Grant SMS permissions to this app in your device settings.
ru: Предоставьте SMS разрешения этому приложению в настройках устройства.
uz: Qurilma sozlamalarida bu ilovaga SMS ruxsatlarini bering.

# networkIssue
source: Network
ru: Сеть
uz: Tarmoq

# networkDesc
source: Ensure you have cellular network coverage.
ru: Убедитесь, что у вас есть покрытие сотовой сети.
uz: Uyali tarmoq qamrovi borligini tekshiring.

# phoneNumberFormat
source: Phone Number
ru: Номер Телефона
uz: Telefon Raqami

# phoneNumberDesc
source: Verify the phone number format is correct (include country code if needed).
ru: Проверьте правильность формата номера телефона (включите код страны при необходимости).
uz: Telefon raqami formati to'g'riligini tekshiring (kerak bo'lsa mamlakat kodini qo'shing).

source: Device Support
ru: Поддержка Устройства
uz: Qurilma Qo'llab-quvvatlash

# deviceSupportDesc
source: Some emulators or devices may not support SMS functionality.
ru: Некоторые эмуляторы или устройства могут не поддерживать SMS функциональность.
uz: Ba'zi emulyatorlar yoki qurilmalar SMS funksiyasini qo'llab-quvvatlamaydi.

source: Common Error Codes:
ru: Частые Коды Ошибок:
uz: Keng Tarqalgan Xato Kodlari:

source: Close
ru: Закрыть
uz: Yopish

source: Error
ru: Ошибка
uz: Xato

source: Success
ru: Успех
uz: Muvaffaqiyat

source: OK
ru: ОК

source: Test message sent successfully!
ru: Тестовое сообщение успешно отправлено!
uz: Sinov xabari muvaffaqiyatli yuborildi!

# failedToSendTestMessage
source: Failed to send test message: {error}
ru: Не удалось отправить тестовое сообщение: {error}
uz: Sinov xabarini yuborishda xato: {error}

# messagesSentSuccessfully
source: Messages sent successfully to {count} contacts!
ru: Сообщения успешно отправлены {count} контактам!
uz: {count} ta kontaktga xabarlar muvaffaqiyatli yuborildi!

# failedToSendMessages
source: Failed to send messages: {error}
ru: Не удалось отправить сообщения: {error}
uz: Xabarlarni yuborishda xato: {error}

source: No file selected
ru: Файл не выбран
uz: Hech qanday fayl tanlanmagan
